// 版本控制软件：用来记录文件的变化（新增文件，修改文件，删除文件等操作；用于团队协作）

// 分类:本地 - 集中化 - 分布式 (比较主流,代表性的工具 git)
// 集中化 - SVN 缺点：依赖网络
// 分布式 - Git 优点：在没有网络的状态下，依旧可以本地提交（不仅仅是记录变化的部分，把原来的也拷贝了一份，相对  也比较耗费  

// 特点： git 所有的操作近乎都是在本地进行的（速度快）

// 三个区域：工作区（就是现在处理的地方） 
        //  暂存区（刚刚已经把某个功能已经万善了，提交到暂存区
        //  仓库（将所有的更改全部放到总仓库里面保存 store)

// 三个状态：已修改状态 modified     已暂存状态 staged     已提交状态 committed

// 流程：对文件进行修改 --> 需要进行暂存 --> 总的提交（本地提交，提交到仓库）

// 打开终端的方式
// cd 你要进入的文件夹路径
// ls 可以列出当前路径下面的所有的文件和文件夹
// 按着shift 键，同时鼠标单机右键，旋转powershell 选项

// 检测git 安装的版本：git --version 如果能正常输出版本号就表示安装成功

// 配置用户名和邮箱
// git config --global user.name "你的姓名的拼音"
// git config --global user.email "你的手机号@163.com"

// 检测配置用户名和邮箱是否配置完毕
// git config user.name
// git config user.email 运行这两行代码，如果能正常输出之前配置过得用户名和邮箱就代表配置成功

// 全局配置的用户名和邮箱具体配置的位置 c:\Users\用户名\.gitconfig

// 查看全局所有的配置项：git config --list --global

// 获取帮助信息：git config -h

// 使用 cls 可以清除之前输入的一些命令

// 获取 git仓库 的两种方式：
// 方式一：可以将本地的某个文件夹转换成git仓库 (需要执行 git init 命令)
// 方式二:可以直接从远程服务器克隆(拷贝)一分下来

// 修改再提交